{
  "base_model_name_or_path": "/data/Dcode/pranav/genoscanner/scanner_model/pretrained_6mer/",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "query",
    "value",
    "key",
    "dense"
  ],
  "task_type": "SEQ_CLS"
}